<?php

use think\facade\Db;
use think\migration\Seeder;

class InitialDataSeeder extends Seeder
{
    /**
     * Run Method.
     *
     * Write your database seeder using this method.
     *
     * More information on writing seeders is available here:
     * http://docs.phinx.org/en/latest/seeding.html
     */
    public function run(): void
    {
        //模拟员工数据
        $cmd = <<<CMD
        INSERT INTO staff (id, name, is_night_group) VALUES 
        (1,'护士01',1),(2,'护士02',1),(3,'护士03',1),(4,'护士04',1),(5,'护士05',1),(6,'护士06',1),
        (7,'护士07',0),(8,'护士08',0),(9,'护士09',0),(10,'护士10',0),(11,'护士11',0),(12,'护士12',0),
        (13,'护士13',0),(14,'护士14',0),(15,'护士15',0),(16,'护士16',0),(17,'产假护士',0),(18,'护士18',0),(19,'护士19',0);
        CMD;

         try {
            Db::query($cmd);
        } catch (\Throwable $th) {
            var_dump($th->getMessage());
        }

        // 获取本周一的日期
        $day1 = date('Y-m-d', strtotime('monday this week'));
        foreach (range(1, 6) as $d) {
            $var = 'day' . ($d + 1);
            $$var = date('Y-m-d', strtotime($day1 . " +{$d} day"));
        }
        
        //模拟排班数据
        $cmd1 = <<<CMD
        INSERT INTO schedule (staff_id, work_date, shift_name) VALUES

        (1,'#day1#','助夜'),(1,'#day2#','P'),(1,'#day3#','N'),(1,'#day4#','休'),(1,'#day5#','休'),(1,'#day6#','正(医+服)'),(1,'#day7#','正1+2'),

        (2,'#day1#','A1'),(2,'#day2#','助夜'),(2,'#day3#','P'),(2,'#day4#','N'),(2,'#day5#','休'),(2,'#day6#','休'),(2,'#day7#','A1'),

        (3,'#day1#','休'),(3,'#day2#','A1'),(3,'#day3#','助夜'),(3,'#day4#','P'),(3,'#day5#','N'),(3,'#day6#','休'),(3,'#day7#','休(Prn)'),

        (4,'#day1#','A(服)'),(4,'#day2#','休(Prn)'),(4,'#day3#','A1'),(4,'#day4#','助夜'),(4,'#day5#','P'),(4,'#day6#','N'),(4,'#day7#','休'),

        (5,'#day1#','N'),(5,'#day2#','休'),(5,'#day3#','休'),(5,'#day4#','A1'),(5,'#day5#','助夜'),(5,'#day6#','P'),(5,'#day7#','N'),

        (6,'#day1#','P'),(6,'#day2#','N'),(6,'#day3#','休'),(6,'#day4#','休(Prn)'),(6,'#day5#','A1'),(6,'#day6#','A1'),(6,'#day7#','P'),

        (7,'#day1#','休(Prn)'),(7,'#day2#','正1+2'),(7,'#day3#','正1+2'),(7,'#day4#','正1+2'),(7,'#day5#','正1+2'),(7,'#day6#','正1+2(代理)'),(7,'#day7#','休'),

        (8,'#day1#','A2'),(8,'#day2#','A2'),(8,'#day3#','A2'),(8,'#day4#','A2'),(8,'#day5#','A2'),(8,'#day6#','休(Prn)'),(8,'#day7#','休'),

        (9,'#day1#','正(中)'),(9,'#day2#','正(中)'),(9,'#day3#','正(中)'),(9,'#day4#','正(中)'),(9,'#day5#','正(中)'),(9,'#day6#','休'),(9,'#day7#','休'),

        (10,'#day1#','正1+2'),(10,'#day2#','休'),(10,'#day3#','正(医)'),(10,'#day4#','正(医)'),(10,'#day5#','正(医)'),(10,'#day6#','休'),(10,'#day7#','A2'),

        (11,'#day1#','休'),(11,'#day2#','A(服)'),(11,'#day3#','A(服)'),(11,'#day4#','A(服)'),(11,'#day5#','A(服)'),(11,'#day6#','A2'),(11,'#day7#','休'),

        (12,'#day1#','正(医)'),(12,'#day2#','正(医)'),(12,'#day3#','休(Prn)'),(12,'#day4#','休'),(12,'#day5#','休'),(12,'#day6#','休'),(12,'#day7#','正(医+服)(代理)'),

        (13,'#day1#','中医护理门诊'),(13,'#day2#','中医护理门诊'),(13,'#day3#','中医护理门诊'),(13,'#day4#','中医护理门诊'),(13,'#day5#','中医护理门诊'),(13,'#day6#','中医护理门诊'),(13,'#day7#','中医护理门诊'),

        (17,'#day1#','120'),(17,'#day2#','121'),(17,'#day3#','122'),(17,'#day4#','123'),(17,'#day5#','124'),(17,'#day6#','125'),(17,'#day7#','126'),

        (14,'#day1#','正'),(14,'#day2#','正'),(14,'#day3#','正'),(14,'#day4#','正/休'),(14,'#day5#','正'),(14,'#day6#','正/休'),(14,'#day7#','休'),
        (15,'#day1#','正'),(15,'#day2#','正'),(15,'#day3#','正'),(15,'#day4#','正/休'),(15,'#day5#','正'),(15,'#day6#','正/休'),(15,'#day7#','休'),
        (16,'#day1#','正'),(16,'#day2#','正'),(16,'#day3#','正'),(16,'#day4#','正'),(16,'#day5#','正'),(16,'#day6#','休'),(16,'#day7#','休'),
        (18,'#day1#','正'),(18,'#day2#','正'),(18,'#day3#','正'),(18,'#day4#','正'),(18,'#day5#','正'),(18,'#day6#','休'),(18,'#day7#','休'),
        (19,'#day1#','正'),(19,'#day2#','正'),(19,'#day3#','正'),(19,'#day4#','正'),(19,'#day5#','正'),(19,'#day6#','休'),(19,'#day7#','休');
        CMD;

        $cmd1 = str_replace(['#day1#', '#day2#', '#day3#', '#day4#', '#day5#', '#day6#', '#day7#'],
            [$day1, $day2, $day3, $day4, $day5, $day6, $day7], $cmd1);

        try {
            Db::query($cmd1);
        } catch (\Throwable $th) {
            var_dump($th->getMessage());
        }
    }
}